app/controllers/articles_controller.rb

  def index
   @articles = Article.all.order("id Desc").page(params[:page]).per(10)
---
SELECT  `articles`.* FROM `articles` ORDER BY id Desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `articles`

  def create
   Article.create(title: articles_params[:title], text: articles_params[:text],user_id: current_user.id)
---
INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('fipasdgesgajdkjbs', 'gjeajgieajvglarjbl ', '2019-06-23 07:58:41', '2019-06-23 07:58:41')

  def destroy
    article = Article.find(params[:id])
    article.destroy
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 56 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 56

  def update
    article = Article.find(params[:id])
    article.update(title: articles_params[:title], text: articles_params[:text],user_id: current_user.id)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 66 LIMIT 1
UPDATE `articles` SET `title` = 'f', `text` = '', `updated_at` = '2019-06-23 08:10:57' WHERE `articles`.`id` = 66